Revit 2027 API
FaceToposolid.Create Method
 Creates a new instance of a face toposolid attached to a non-vertical massing face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FaceToposolid Create(
	Document document,
	ElementId toposolidTypeId,
	ElementId levelId,
	IList<Reference> faceReferences
)
Public Shared Function Create (
	document As Document,
	toposolidTypeId As ElementId,
	levelId As ElementId,
	faceReferences As IList(Of Reference)
) As FaceToposolid
public:
static FaceToposolid^ Create(
	Document^ document,
	ElementId^ toposolidTypeId,
	ElementId^ levelId,
	IList<Reference^>^ faceReferences
)
static member Create :
        document : Document *
        toposolidTypeId : ElementId *
        levelId : ElementId *
        faceReferences : IList<Reference> -> FaceToposolid
Parameters
document Document
 The document.
toposolidTypeId ElementId
 The toposolid type.
levelId ElementId
 The level id.
faceReferences IList<Reference>
 The references from the massing face.
Return Value
FaceToposolid
 The newly created face toposolid.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document. -or- Toposolid type is not valid for this face toposolid. -or- The ElementId levelId is not a Level. -or- The faces are not valid for face toposolid creation.
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
FaceToposolid Class
Autodesk.Revit.DB Namespace